{
    "livros": [
        "Lista com as 147 obras usadas como referência básica, foram desconsideradas as edições dos livros.",
        "SOUZA, et al. Algoritmos e Lógica de Programação. Ed Cengage Learning, 2011",
        "LOPES, A.; GARCIA, G.; Introdução a programação: 500 algoritmos resolvidos. Ed Campus, 2002",
        "BARRY, P.; GRIFFITHS, D.; Use a Cabeça! Programação. 1ª ed. Rio de Janeiro:Alta Books, 2010",
        "MANZANO, J. A. N. G. Algoritmos: lógica para desenvolvimento de programação de computadores. 27 ed. São Paulo: Érica, 2012",
        "MANZANO, J. A. N. G. Técnicas de programação. 1ª ed. São Paulo: Érica, 2014.",
        "SZWARCFITER, J. L. Estruturas de dados e seus algoritmos. 3ª ed. Rio de Janeiro: Bertrand Brasil, 2015",
        "ASCENCIO, A. F. G.; CAMPOS, E. A. V. Fundamentos da programação de Computadores: algoritmos, Pascal e C/C++ e Java. 2ª ed. São Pauo: Pearson Prentice Hall, 2009",
        "FORBELLONE, A. L. V.; EBERPACHER, H. F. Lógica de Programação: a construção de algoritmos e estruturas de dados. 3ª ed. São Paulo: Pretice Hall, 2008",
        "MEDINA, M.; FERTIG, C. Algoritmos e Programação: Teoria e Prática. São Paulo: Novatec, 2005",
        "SOUZA, et al. Algoritmos e Lógica de Programação. São Paulo: Editora Pioneira Thomson, 2005",
        "JUNIOR, D. P. et al. Algoritmos e Programação de computadores. Editora Campus, 2012",
        "SEBESTA, R. W. Conceitos de Linguagem de Programação. 1ª ed. São Paulo: Editora Bookman, 2011",
        "STROUSTRUP, B. Princípios e Práticas de Programaçaõ com C++. 1ª ed. Editora Bookman, 2012",
        "MORAES, C. R. Estrutura de dados e algoritmos. São Paulo: Futura, 2003",
        "TONET, B.; KOLIVER, C. Introdução ao algoritmos. NAPRO. UCS - Universidade de Caxias do Sul.",
        "FARRER, H. et al. Algoritmos Estruturados. Editora LTC, 1999",
        "LEISERON, C. et al. Algoritmos teoria e prática. Editora Campus, 2002",
        "SWAN, T. Aprendendo C++. Editora Campus Ltda, 1993",
        "SCHILDT, H. Borland C++: Completo e Total. Makron Books, 1997",
        "MANZANO, J. A. N. G.; OLIVEIRA, J. F. Estudo dirigido: Algoritmos. 11ª ed. São Paulo: Érica, 2007",
        "BROD, C. Aprenda a programar. São Paulo: Novatec, 2013",
        "VILARIM, G. Algoritmos: programação para iniciantes. Rio de Janeiro: Ciência Moderna, 2004",
        "FARREL, J. Lógica e design de programação: introdução. São Paulo: Cengage Learning, 2010",
        "DEITEL, P.; DEITEL, H. C: como programar. Traduzido do Original: C: how to program; Tradução: Daniel Vieira; Revisão Técnica: César Augusto Cardoso Caetano. 6ª ed. São Paulo: Pearson, 2011",
        "GUIMARÃES, A.; LAGES, N. A. C. Algoritmos e Estruturas de Dados. 21ª tiragem. São Paulo: LTC, 1994",
        "AGUILAR, L. J. Fundamentos de Programação: Algoritmos, Estruturas de Dados e Objetos. 3ªed. McGraw-Hill Brasil, 2008",
        "DASGUPTA, S.; PAPADIMITRIOU, C.; VAZIRANI, U. Algoritmos. McGraw-Hill Brasil, 2009",
        "PIVA JUNIOR, D. et al. Algoritmos e programação de computadores. Rio de Janeiro: Elsevier, 2012",
        "XAVIER, G. F. C. Lógica de programação. 12ª ed. rev. atual. São Paulo: Senac São Paulo, 2001",
        "DAMAS, L. Linguagem C. 1ª ed. Editora LTC, 2007",
        "SILVA, M. S. Javascript - Guia do Programador. São Paulo: Novatec, 2010",
        "SAMPAIO, C. Javascript de cabo a rabo. Rio de Janeiro: Ciência Moderna, 2015",
        "ASCENCIO, A. F. G. Estrutura de dados. São Paulo: Pearson, 2011",
        "GOODRICH, M. T.; TAMASSIA, R. Estruturas de dados e algoritmos em Java. 5ª ed. Bookman, 2013",
        "ALBANO, R. S.; ALBANO, S. G. Programação em Linguagem C. Rio de Janeiro: Ciência Moderna, 2010",
        "MANZANO, J. A. N. G. Estudo dirigido de Linguagem C. 17ª ed. Érica, 2013",
        "PEREIRA, S. L. Algoritmos e lógica de programação em C - uma abordagem didática. Editora Érica, 2010",
        "CORMEN, T. H. et al. Algoritmos: teoria e prática. Editora Campus, 2002",
        "DEITEL, H. M.; DEITEL, P. J. Java: Como programar. 6ª ed, 2005",
        "POLETINI, R. A. Linguagem de programação C Primeiros Programas. Rio de Janeiro: Editora Ciência Moderna, 2014",
        "KOCHAN, S. G. Programação com objective C. 5ª ed. Editora Bookman, 2014",
        "PINHEIRO, F. A. Elementos de programação em C. Editora Bookman, 2012",
        "MENZES, N. N. C. Introdução à Programação com Python: Algoritmos e lógica de programação para iniciantes. 2ª ed. São Paulo: Novatec, 2014",
        "ARCENIO, A. F. G. Lógica de Programaçaõ com Pascal. Editora Makron Books.",
        "FARRER, H.; BECKE, C. G.; FARIA, E. C. Pascal estruturado: Programação Estruturada de Computadores. Editora LTC.",
        "BOOKS, M. Lógica de Programação - A construção de algoritmos e estrutura de dados. 2ª ed. Ed. Markron Books, 2000",
        "SCHILDT, G. C Completo e total. 3ª ed. São Paulo: Markron Books, 1997",
        "MIZRAHI, V. V. Treinamento em linguagem C. 2ª ed. São Paulo: Prentice Hall do Brasil, 2008",
        "EVARISTO, J. Aprendendo a programar programando em C. Rio de Janeiro: Book Express, 2001",
        "FEOFILOFF, P. Algoritmos em linguagem C. Rio de Janeiro: Elsevier, 2009",
        "ARAÚJO, E. C. Algoritmos: Fundamentos e prática. Florianópolis: Visual Books, 2007",
        "BENEDUZZI, H. M.; METZ, J. A. Lógica e Linguagem de Programação. Curitiba: Editora do Livro Técnico, 2010",
        "BORATTI, I. C.; OLIVEIRA, A. B. Introdução à progamação: algoritmos. 3ª ed. Visual Books, 2007",
        "PUGA, S. Lógica de programação e estruturas de dados, com aplicações em JAVA. Pearson, 2009",
        "XAVIER, F. S. V. PHP do básico a orientação a objetos. Rio de Janeiro: Ciência Moderna, 2008",
        "ALMEIDA, D. S. Lazarus e Free Pascal. Rio de Janeiro: ClubeDelphi, ano 9, n. 122, 123, 2010",
        "SINTES, A. Aprenda Programação Orientada a Objetos em 21 dias. São Paulo: Makron Books, 2002",
        "BROKSHEAR, J. G. Ciência da computação - Uma visão abrangente. Porto Alegre: Bookman, 2000",
        "NORTON, P. Introdução à Informática. São Paulo: Makron Books, 1999",
        "WEBER, R. P. Arquitetura de Computadores pessoais. Porto Alegre: Sagra, 2000",
        "MONTEIRO, M. Introdução à Organização de Computadores. Rio de Janeiro: Livros Técnicos e Científicos LTDA, 1996",
        "MEIRELLES, F. S. Informática: Novas aplicaçãoes com Microcomputadores. São Paulo: Makron Books, 1994",
        "VELLOSO, F. C. Informática: Conceitos Básicos. Rio de Janeiro: Ed. Campus, 1994",
        "SILVEIRA, P.; ALMEIDA, A. Lógica de Programação. São Paulo: Casa do Código, 2012",
        "GIMENES, I. M. S. (Org); HUZITA, E. H. M. (Org). Desenvolvimento baseado em componentes: conceitos e técnicas. Rio de Janeiro: 2005",
        "WIRTH, N. Algoritmos e Estrutura de Dados. Reimpr. Rio de Janeiro: Prentice-Hall do Brasil Ltda, 1986",
        "ZIVIANI, N. Projeto de Algoritmos com implementações em Pascal e C. 2ª ed. São Paulo: Editora Thomson, 2007",
        "CELES, W.; CERQUEIRA, R.; RANGEL, J. Introdução a Estruturas de Dados. 1ª ed. Rio de Janeiro: Campus, 2004",
        "SALVETTI, D. D.; BARBOSA, L. M. Algoritmos. Pearson Mkron Books, 2004",
        "ALENCAR FILHO, E. Iniciação à lógica matemática. 21ª ed. São Paulo: Nobel, 2008",
        "PINTO, W. S. Introdução ao desenvolvimento de algoritmos e estrutura de dados. Ed. Érica: 1991",
        "INSTITUTO BRASILEIRO DE PESQUISA EM INFORMÁTICA. Técnicas de Programação com Pascal. Rio de Janeiro: Editora LTC, 1988",
        "VILLAS, M. V. Programação: conceitos, técnicas e linguagens. Rio de Janeiro: Campus, 1988",
        "TERADA, R. Desenvolvimento de Algoritmos e Estrutura de Dados. Ed. Makron Books.",
        "KOTANI, A. M. et al. Lógica de Programação. Ed. Érica.",
        "CURY, M. X. Introdução à lógica. Ed. Érica.",
        "SALIBA, W. L. C. Técnicas de Programação: uma abordagem estruturada. São Paulo: Makron, McGraw-Hill, 1992",
        "EDELWEIS, N. GALANTE, R. Estrutura de dados. Porto Alegre: Bookman, 2009",
        "ALVES, W. P. Linguagem e Lógica de Programação. São Paulo: Editora Érica, 2014",
        "CAMARGOS, L. F. M.; MENEZES, M. A. F. Introdução a HTML e PHP. 1ª ed. Rio de Janeiro: Ciência Moderna, 2008",
        "DALL'OGLIO, P. PHP - Programando com orientação a objetos. 2ª ed. Novatec, 2009",
        "BACKES, A. Linguagem C: Completa e descomplicada. Rio de Janeiro: Editora Campus-Elsevier, 2012",
        "ANICHE, M. Introdução à programação em C: Os primeiros passos de um desenvolvedor. São Paulo: Casa do Código, 2015",
        "CORMEN, T. Desmistificando Algoritmos. Editora Campus-Elsevier, 2013",
        "MARJI, M. Aprenda a programar com Scratch. Editora Novatec, 2014",
        "CAMPOS, F. F. Algoritmos numéricos. 2ª ed. Rio de Janeiro: LTC, 2010",
        "HEINEMAN, T.; POLLICE, G. SELKOW, S. Algoritmos: o guia essencial. 2ª ed. Rio de Janeiro: Alta Books, 2009",
        "MENEZES, N. N. C. Introdução à Programação com Python - Algoritmos e lógica de programação para iniciantes. 2ª ed. Novatec, 2014",
        "BEAZLEY, D.; JONES, B. K. Python Cookbook. Novatec, 2013",
        "PRESSMAN, R. S. Engenharia de Software. 5ª ed. McGraw-Hill",
        "SHARMA, V.; SHARMA, R. Desenvolvendo sites de e-comerce. Makron Books",
        "CHAN, M. C. et al. Java: 1001 Dicas de Programação. Makron Books",
        "TREMBLEU, B. Ciência dos Computadores: uma abordagem algorítmica.",
        "GUEZZI, C. Conceitos de Linguagem de Programação.  Editora Campus.",
        "CERICOLA, O. V. Banco de Dados relacional e distribuídos. Rio de Janeiro: LTC, 1991",
        "DATE, C. J. Introdução à Sistermas de Banco de Dados. Rio de Janeiro: Campus, 1991",
        "SOMMERVILLE, I. Engenharia de Software. Addison Wesley, 1995",
        "NORTON, P. A Bíblia do programador. Campus",
        "GOODRICH, M. T.; TAMASSIA, R. Projeto de algoritmos: fundamentos, análise e exemplos da internet. Porto Alegre: Bookman, 2004",
        "CORDEIRO, J. Transição para C++ para programadores de C. Escola Superior de Tecnologia: Instituto Politécnico de Setúbal, 1998",
        "DROZDEK, A. Estrutura de Dados e Algoritmos em C++. Ed. Pioneira Thomson Learning, 2002",
        "LEWIS, H. Elementos da Teoria da Computação - Bookman, 1999",
        "SUMMERFIELD, M. Programação em Python 3: uma introdução completa à linguagem Python. Rio de Janeiro: Alta Books, 2013",
        "BORGES, L. E. Python: para desenvolvedores. São Paulo: Novatec, 2014",
        "KELLER, V.; BASTOS, C. L. Aprendendo lógica. 19ª ed. Petrópolis: Vozes, 2011",
        "GELSON, I. Matemática. 1ª ed. São Paulo: Atual, 2007",
        "GELSON, I et al. Matemática: Ciência e Aplicações. 4ª ed. Pearson Pretice Hall, 2011",
        "GRIFFITHS, D. Use a Cabeça! C. 1ª Alta Books, 2013",
        "AVILLANO, I. C. Algoritmos e Pascal: manual de apoio. 2ª ed. Rio de Janeiro: Ciência Moderna, 2006",
        "EGYPTO, C. Lógica e Algoritmos. CEFET-PB, 2003",
        "SIMÃO, D. H.; REIS, W. J. Lógica de Programação: conhecendo algoritmos e criando programas. São Paulo: Viena, 2015",
        "RAMALHO, L. Python Fluente:  Programação clara, concisa e eficiente. São Paulo: Novatec, 2015",
        "FEIJÓ, B.; CLUA, E.; SILVA, F. S. Introdução à Ciência da Computação com Jogos. Rio de Janeiro: Campus/Elsevier, 2009",
        "RITA; S. Treinamento em Lógica de Programação. São Paulo: Universo dos Livros, 2015",
        "MCCUE, C. Programação para adolescentes para leigos. Rio de Janeiro: Alta Books, 2016",
        "GOYA, R. R. Introdução a Programação em Linguagem Python, 2015",
        "DEITEL, H. M,; DEITEL, P. J. C++ - Como Programar. 5ª ed. São Paulo: Pearson, 2006",
        "MORRISON, M. Use a cabeça: Javascript. Rio de Janeiro: Alta Books, 2012",
        "ZIVIANI, N. Projeto de Algoritmos com Implementações em Java e C++. São Paulo: Cengage Learning, 2006",
        "BARNES, D. J.; KOLLING, M. Programação orientada a objetos com Java. 4ª ed. Pearson, 2008",
        "SANTOS, R. Introdução à programação orientada a objetos usando JAVA. 7ª ed. Elsevier, 2003",
        "PREISS, B. R. Estruturas de dados e algoritmos: padrões de projetos orientados a objetos com Java. Rio de Janeiro: Elsevier, 2001",
        "HAVERBERKE, M. Eloquent JavaScript: a modern introduction to programming. San Francisco: No startch Press, 2011",
        "MANZANO, J. A. N. G. Programação de computadores com C++: guia prático de orientação e desenvolvimento.",
        "OLIVEIRA, U. Programando em C - Volume 1: Fundamentos. Editora Ciência Moderna, 2007",
        "BARBIERI FILHO, P.; HETEM JUNIOR, A. Fundamentos de informática: lógica para computação. Rio de Janeiro: LTC, 2013",
        "OKUYAMA, F. Y.; MILETTO, E. M.; NICOLAO, M. (Orgs) Desenvolvimento de software I: conceitos básicos. Porto Alegre: Bookman, 2014",
        "FURGERI, S. Java 7: ensino didático. 2ª ed. São Paulo: Érica, 2012",
        "MANZANO, J. A. N. G.; COSTA JUNIOR, R. A. Java SE 7: programação de computadores: guia prático de introdução, orientação e desenvolvimento. São Paulo: Érica, 2011",
        "HORSTMANN, C. S.; CORNELL, G. Core Java. Volume 1: Fundamentos, 8ª ed. São Paulo: Érica, 2011",
        "WINDER, R.; ROBERTS, G. Desenvolvendo software em Java. 3ª ed. Rio de Janeiro: LTC, 2009",
        "SIERRA, K.; BATES, B. Use a cabela! Java. 2ª ed. Rio de Janeiro: Alta Books, 2010",
        "ANDERSON, J.; VALÉRIO, J. D. P. Java 6 - Uma abordagem Ativa de Aprendizado, 2ª ed. Rio de Janeiro: LTC, 2010",
        "SCHILDT, H. Java para Iniciantes. 6ª ed. Porto Alegre: Bookman, 2015",
        "COSTA, L.; MOREIRA, C. Java para iniciantes. Rio de Janeiro: Ciência Moderna. 2002",
        "GOODMAN, D. JavaScript & HTML: guia prático. Rio de Janeiro: Alta Books, 2008",
        "IEPSEN, E. F. Lógica de Programação e Algoritmos com JavaScript: uma introdução à programação  de computadores com exemplos e exercícios para iniciantes. Novatec, 2018",
        "MELLO, R.; CHIARRA, R.; VILLELA, R. Aprendendo Java 2. São Paulo: Novatec, 2002",
        "JOYANES, L. A. Fundamentos de Programação: algoritmos, estruturas de dados e objetos. 3ª ed. São Paulo: McGraw-Hill Brasil, 2008",
        "PERKOVIC, L. Introdução à Computação usando Python: Um foco no desenvolvimento de aplicações. LTC, 2016",
        "OLIVEIRA, C. L. V.; LÜHMANN, A. C. O. Aprenda lógica de programação e algoritmos. Rio de Janeiro: Ciência Moderna, 2016",
        "MORAES, P. S. Lógica de Programação. UNICAMP, 2000",
        "KERNIGHAN, B. W.; RITCHIE, D. M. C: a linguagem de programação, padrão ANSI. Rio de Janeiro: Campus, 1995",
        "TENENBAUM, A. M.; LANGSAN, Y.; AUGENSTEIN, M. J. Estruturas de Dados Usando C. São Paulo: Editora Makron Books, 1995",
        "ALMEIDA, R. S. Aprendendo Algoritmo com VisuAlg. São Paulo: Ciência Moderna, 2013",
        "SCHILDT, H. Turbo C - Guia do usuário. Editora Mc-GrawHill, 1988",
        "SERÁTES, J. Racicínio Lógico: lógico matemático, lógico quantitativo, lógico numérico, lógico analítico, lógico crítico. Brasília: Editora Jonofon, Volumes I e II, 10ª ed."
    ]
}