{
    "livros": [
        "Lista com as 202 obras usadas como referência complementar, foram desconsideradas as edições dos livros.'",
        "ASCENCIO, A. F. G.; CAMPOS, E. A. V. Fundamentos da programação de Computadores: algoritmos, Pascal e C/C++ e Java. 3ª ed. São Pauo: Pearson Prentice Hall, 2012",
        "GOODRICH, M. T. Estrutura de dados e algoritmos em java. 5ª ed. Porto Alegre: Bloockman, 2013",
        "LAUREANO, M. Lógica de programação: uma abordagem em Pascal, ou, Pascal em alguns minutos. Rio de Janeiro: Ciência Moderna. 2010",
        "CORMEN, T. H. Algoritmos: teoria e prática. Rio de Janeiro. Elsevier, 2012",
        "PREISS, B. R. Estruturas de dados e algoritmos: padrões de projetos orientados a objetos com Java. Rio de Janeiro: Elsevier, 2001",
        "BORATI, I. C.; OLIVEIRA, A. B. Introdução à programação: algoritmos. 2ª ed. São Paulo: Editora Visual Books, 2004",
        "CARBONI, I. Lógica de Programação. São Paulo: Editora Pioneira Thomson, 2003",
        "CORMEN, T. H. Algoritmos: teoria e prática. Rio de Janeiro. Elsevier, 2002",
        "KERNIGHAN, B. W.; RITCHIE, D. M. C Linguagem de Programação: padrão ansi. Rio de Janeiro: Editora Campus, 1990",
        "LOPES, A.; GARCIA, G. Introdução a programação: 500 algoritmos. Rio de Janeiro: Campus, 2002",
        "DAMIANI, E. Programação de Jogos Android. Editora novatec, 2014",
        "GOODLIFFE, P. Como ser um programador melhor: um manual para programadores que se importam com o código. Editora Novatec, 2015",
        "MENEZES, N. N. C. Introdução à programação com Python. Editora Novatec, 2014",
        "FARRER, H. et al. Algoritmos Estruturados. 3ª ed. Rio de Janeiro: LTC, 1999",
        "MANZANO, J. A. N. G.; YAMATUMI, W. Y. Programando em Turbo Pascal 7.0. São Paulo: Érica, 2001",
        "LEISERSON, C. et al. Algoritmos Teoria e Prática. 2ª ed. São Paulo: Campus, 2002",
        "MEDINA, M.; FERTIG, C. Algoritmos e Programação - Teoria e Prática. São Paulo: Novatec, 2005",
        "FERNANDES, A. L. B. Construção de Algoritmos. Rio de Janeiro: Ed. Senac Nacional, 1998",
        "BARRY, P. Use a cabeça! Programação. Rio de Janeiro: Alta Books, 2011",
        "DEITEL, H. M. Java - Como programar. 6ª ed. São Paulo: Prentice Hall Brasil, 2007",
        "GRIFFITHS, D. D. Use a Cabeça! C. Rio de Janeiro: Alta Books, 2013",
        "JUNIOR, P. J. L. Java - Guia do Programador. São Paulo: Novatec, 2007",
        "PINHEIRO, F. A. C. Elementos de Programação em C. Porto Alegre: Bookman, 2012",
        "SENNE, E. L. F. Primeiro curso de programação em C. Florianópolis: Visual Books, 2009",
        "SEBESTA, R. W. Conceitos de linguagem de programação. Porto Alegre: Bookman, 2011",
        "ZIVIANI, N. Projeto de Algoritmos com implementação em Java e C++. Rio Grande do Sul: Cengage Learning, 2007",
        "ALENCAR FILHO, E. Iniciação à lógica matemática. 21ª ed. São Paulo: Nobel, 2008",
        "DEITEL, H. M. C++: como programar. 5ª ed. São Paulo: Pearson Prentence, 2006",
        "FURGERI, S. Java 7: ensino didático. 2ª ed. São Paulo: Érica, 2012",
        "DROZDEK, A. Estrutura de dados e algoritmos C++. São Paulo: Pioneira Thomson Learning, 2002",
        "FORBELLONE, A. L. V.; EBERSPACHER, H. F. Lógica de programação: a construção de algoritmos e estruturas de dados. 3ª ed. São Paulo: Pearson Prentice Hall, 2005",
        "PRESSMAN, R. S. Engenharia de Software. 6ª ed. São Paulo: MacGraw-Hill, 2010",
        "SALVETTI, D. D.; BARBOSA, L. M. Algoritmos. São Paulo: Makron Books, 1998",
        "TUCKER, A. B.; NOONAN, R. E. Linguagens de programação: princípios e paradigmas. 2ª ed. São Paulo: MacGraw Hill, 2008",
        "FARREL, J. Lógica e Design de Programação: Introdução. 5ª ed. São Paulo: Cengage Learning, 2010",
        "DAMAS, L. Linguagem C. Tradução: João Araújo Ribeiro e Orlando Bernardo Filho. 10ª ed. Rio de Janeiro: LTC, 2012",
        "SCHILDT, H. C completo e total. Traduzido do original: C the complete reference. Tradução e revisão técnica: Roberto Carlos Mayer. 3ª ed. rev. e atualizada. São Paulo: Pearson, 1997",
        "VILARIM, G. Algoritmos - Programação para Iniciantes. Ciência Moderna. Rio de Janeiro, 2004",
        "ENGELBRECHT, A. M. et al. Algoritmos e programação de computadores. Rio de Janeiro: Campus, 2012",
        "DASGUPTA, S.; VAZIRANI, U. Algoritmos. São Pauo: Pearson Mcgraw-Hill, 2009",
        "FEOFILOOF, P. Algoritmos em linguagem C. Rio de Janeiro: Elsevier, 2009",
        "GILMORE, W. J. Dominando PHP e MYsql: do iniciante ao profissional. 1ª ed. 2. reimp. Rio de Janeiro: Alta Books, 2011",
        "SILVA, M. S. Ajax com jQuery. São Paulo: Novatec, 2009",
        "STEFANOV, S. Padrões Javascript. São Paulo: Novatec, 2010",
        "MILANI, A. Construindo aplicações web com PHP e MySQL. São Paulo: Novatec, 2010",
        "LOCKHART, P. PHP Moderno. São Paulo: Novatec, 2015",
        "DALL'OGLIO, P. PHP: Programando com Orientação a Objetos. 3ª ed. São Paulo: Novatec, 2015",
        "TERADA, R. Desenvolvimento de algoritmos e estrutura de dados. São Paulo: McGraw-Hill, 1991",
        "SOUZA, M. A. F. et al. Algoritmos e lógica de programação. São Paulo: Thomson Learning, 2006",
        "OLIVEIRA, U. Programando em C. Volume I. Rio de Janeiro: Ciência Moderna, 2008",
        "SHILDT, H. C, completo e total. 3ª ed. Tradução: MAYER, Roberto Carlos. São Paulo: Makron Books, 1997",
        "LEITE, M. Curso Básico de C - Prático e Fácil - Contém 111 exercícios propostos e resolvidos. 1ª ed. Rio de Janeiro: Ciência Moderna, 2013",
        "XAVIER, G. F. C. Lógica de Programação. 13ª ed. SENAC, 2014",
        "TENENBAUM, A. M.; LANGSAM, Y.; AUGENSTEIN, M. J. Estruturas de dados usando C. 3ª ed, 2011",
        "DEITEL, H.; DEITEL, P. C: como programar. 6ª ed. Peardson: 2011",
        "MANZANO, J. A. N. G. Estudo dirigido de Linguagem C. 17ª ed. Editora Érica, 2013",
        "PEREIRA, S. L. Algoritmos e Lógica de programação em C: uma abordagem didática. São Paulo: Érica, 2010",
        "COSTA, E. M. M. Editora Ciência Moderna, 2011 (INCOMPLETO - PROVAVELMENTE É C Aplicado ao Aprendizado de Cálculo)",
        "PIVA JUNIOR, D. et al. Algoritmos e Programação de Computadores. Rio de Janeiro: Elsevier, 2012",
        "BENEDUZZI, H. M.; METZ, J. A. Lógica e Linguagem de Programação - Introdução ao desenvolvimento de Software. Editora do Livro Técnico, 2010",
        "LEWIS, H. Elementos da Teoria da Computação. Bookman, 1999",
        "EDELWEISS, N.; GALANTE, R. Estrutura de Dados. Porto Alegre: Bookman, 2009",
        "ASCENCIO, A. F. G. Lógica de programação com Pascal. São Paulo: Makron Books Pearson Education do Brasil, 1999",
        "SILVA, O. Q. Estrutura de dados e algoritmos usando C: fundamentos e aplicações. Rio de Janeiro: Ciência Moderna, 2007",
        "HOLZNER, S. Programando em C++: um guia prático para programação profissional. Editora Campus, 1993",
        "CELES, W. et al. Introdução a Estrutura de Dados - com técnicas de programação em C. Editora Campus, 2003",
        "DAVIS, M. E. Aprendendo PHP e MySQL. Rio de Janeiro: Alta Books, 2008",
        "CASTRO, E. HTM 4 para world wide web. São Paulo: Makron Books, 2000",
        "HEBERT, S. Java para Iniciantes. Porto Alegre: Bookman, 2015",
        "SANTOS, J. P. F. Desenvolvendo aplicativos com Lazarus. 1ª ed, 2011",
        "ARAÚJO, E. C. Algoritmos: fundamento e prática. Florianópolis: Visual Books, 2007",
        "BORGES, R. C. M. Introdução à Informática. Porto Alegre: UFRGS, 2009",
        "VELOSO, P. et al. Estrutura de Dados. Rio de Janeiro: Elsevier, 1983",
        "MEIRELLES, F. S. Informática novas aplicações com microcomputadores. 2ª ed. São Paulo: Pearson Education Brasil, 1994",
        "MEIRELLES, F. S. Informática novas aplicações com microcomputadores. 2ª ed. São Paulo: Pearson Education Brasil, 1994",
        "GUIMARÃES, A. M.; LAGES, N. A. C. Introdução à Ciência da Computação. Rio de Janeiro: RTC, 2012",
        "MORAES, C. R. Estrutura de Dados e Algoritmos. São Paulo: Futura, 2013",
        "SANTOS, C. S.; AZEREDO, P. A. Tabelas: Organização e pesquisa. Porto Alegre: Bookman, 2008",
        "EVARISTO, J. Aprendendo a programar - Programando na Linguagem C. Rio de Janeiro: Book Express, 2004",
        "EGYPTO, C. Lógica e Algoritmos. CEFET-PB: 2003",
        "GUIMARÃES, A. Algoritmos e estruturas de dados. Rio de Janeiro: Editora LTC, 1985",
        "PINTO, W. S. Algoritmos e estruturas de dados. Ed. Érica.",
        "KOTANI, A. M. et al. Lógica de Programação. Ed. Érica",
        "CURY, M. X. Introdução à lógica. Ed. Érica.",
        "CASTRO, J. Linguagem C na prática. 1ª ed. Editora Moderna, 2008",
        "DAGHLIAN, J. Lógica e álgebra de Boole. 4ª ed. São Paulo: Atlas, 1995",
        "PUGA, S.; RISSETTI, G. Lógica de programação e estruturas de dados com aplicações em JAVA. 2ª ed. São Paulo: Pearson Prentice Hall, 2009",
        "WIRTH, N. Algoritmos e Estruturas de Dados. Rio de Janeiro: LTC, 2009",
        "MARJI, M. Aprenda a programar com Scratch: uma introdução visual à programação com jogos, arte, ciência e matemática. São Paulo: Novatec, 2014",
        "SALIBA, W. L. C. Técnicas de Programação. Makron Books, 1992",
        "ARNOLD, K.; GOSLING, J.; HOLMES, D. A linguagem de programação java. Ed. Bookman",
        "CASTRO, E.; HYSLOP, B. HTML 5 e CSS 3. 1ª ed. ALTA BOOKS, 2013",
        "ULLMAN, L. PHP 6 e MYSQL 5 para web sites dinâmicos. Aprenda PHP e MYSQL com rapidez e eficiência. 1ª ed. Rio de Janeiro: Ciência Moderna, 2008",
        "FLANAGAN, D. JAVASCRIPT - o guia definitivo. 6ª ed. Bookman Companhia ED, 2012",
        "SIERRA, K.; BATES, B. Use a cabeça! - Java! 2ª ed. STARLIN ALTA CONSULT, 2007",
        "KOCHA, S. G. Programação com objective C. 5ª ed. Editora Bookman, 2014",
        "TREMBLAY, J. P.; BUNT, R. B. Ciência dos computadores: Uma abordagem algorítmica. São Paulo: McGraw-Hill",
        "SZWARCFITER, J. L.; MARKENZON, L. Estruturas de dados e seus algoritmos. 2ª ed. rev. Rio de Janeiro: LTC, 2009",
        "ZIVIANI, N. Projetos de Algoritmos e Estrutura de Dados. Escola Brasil-Argentina de Informática: Campinas, 1986",
        "JEFF, E. Como pensar sobre Algoritmos. LTC, 2010",
        "SUMMERFIELD, M. Programação em Python 3. Alfa Books, 2013",
        "GLEY, X.; CARDOSO, F. Lógica de Programação. 14ª ed. Senac: São Paulo, 2014",
        "MANZANO, A. L. N. G.; MANZANO, M. I. N. H. Estudo dirigido de informática básica. 7ª ed. rev, atual e ampl. São Paulo: Editora Érica, 2007",
        "HORSTMANN, C. S.; GARY, C. JAVA. 8ª ed. São Paulo: Pearson Prentice Hall, 2010",
        "ANSELMO, F. Aplicando lógica orientada a objetos em Java. 2ª ed. Florianópolis: Visual Books, 2005",
        "MANZANO, J. A. N. G.; OLIVEIRA, J. F. Algoritmos: Lógica para desenvolvimento de programação de computadores. 26ª. São Paulo: Érica, 2012",
        "MANZANO, J. A. N. G.; OLIVEIRA, J. F. Estudo dirigido de Algoritmos. 12ª ed. São Paulo: Livros Érica, 2008",
        "SCHILDT, H. Java para iniciantes: crie, compile e execute programas Java rapidamente. Porto Alegre: Bookman, 2013",
        "PEREIRA, S. L. Estruturas de dados fundamentais: conceitos e aplicações. 12ª ed. São Paulo: Érica, 2008",
        "BOENTE, A. Construindo Algoritmos computacionais: lógica de programação. Rio de Janeiro: BRASPORT, 2003",
        "RAMALHO, L.; KINOSHITA, L. Python Fluente: Programação clara concisa e eficaz. São Paulo: Novatec, 2016",
        "BARRY, P.; PINTO, R. A. Use a Cabeça! Python. Rio de Janeiro: Alta Books, 2012",
        "MITCHELL, R. Web scraping com Python: coletando dados na web moderna. São Paulo: Novatec, 2015",
        "BEAZLEY, D. M.; JONES, B. K. Python Cookbook. São Paulo: Novatec, 2013",
        "SWEIGART, A. Automatize tarefas maçantes com python: programação prática para verdadeiros iniciantes. São Paulo: Novatec, 2015",
        "SAADE, J. C# Guia do Programador. Editora Novatec, 2011",
        "STAIR, R. M. Princípios de Sistemas de Informação. 3ª ed. São Paulo: Cengage Learning, 2015",
        "MENDES, A. Introdução a programação orientada a objetos com C++. 1ª ed. São Paulo: Elsevier, 2010",
        "FREIRE, E.; BATISTA, S. S. S. Sociedade e Tecnologia na Era Digital. 1ª ed. São Paulo: Érica, 2014",
        "BARBIERI FILHO, P. et al. Fundamentos de Informática - Álgebra Linear para Computação. 1ª ed. São Paulo: LTC, 2007",
        "PAIVA, M. Matemática. São Paulo: Moderna, 2003",
        "BACKES, A. Linguagem C: Completa e descomplicada. Elsevier, 2012",
        "PRATA, S. C Primer Plus. 6ª ed. Addison-Wesley Professional, 2013",
        "PERRY, G.; MILLER, D. C programming absolute Beginner's Guide. 2013",
        "MATTHES, E. Curso Intensivo de Python: uma introdução prática e baseada em projetos à programação. Pearson, 2016",
        "ALBANO, R. S.; ALBANO, S. G. Programação em Linguagem C. 1ª ed. Rio de Janeiro: Ciência Moderna, 2010",
        "RINALDI, R. Turbo Pascal 7.0: comandos e funções. São Paulo: Érica, 1993",
        "SCHMITZ, E. A.; TELES, A. A. S. Pascal e técnicas de programação. Rio de Janeiro: LTC, 1985",
        "BROD, C. Aprenda a programar. São Paulo: Novatec, 2013",
        "SILVEIRA, P.; ALMEIDA, A. Lógica de Programação. São Paulo: Casa do Código, 2012",
        "BARNES, D. J.; KOLLING, M. Programação orientada a objetos com Java: uma introdução prática usando BlueJ. 4ª ed. São Paulo: Pearson, 2004",
        "SANTOS, R. Introdução à programação orientada a objetos usando JAVA. Rio de Janeiro: Campus-Elsevier, 2003",
        "VELLOSO, F. C. Informática Conceitos Básicos. 7ª ed. Rio de Janeiro: Elsevier, 2004",
        "GRAHAM, D. L. C Programming Language: A step by step Beginner's Guido to Learn C programmning in 7 days. Scoots Valley: CreateSpace Independent Publishing Plataform, 2017",
        "LEONI, E. Olá Mundo: PHP para iniciantes. Scoots Valley: Createspace Independent Publishing Plataform, 2015",
        "KNUTH, D. E. The art of computer programming: fundamental algorihms. 3ª  ed. São Paulo: Pearson, 2011",
        "ZIVIANI, N. Projeto de Algoritmos com implementação em  Pascal e C. Rio Grande do Sul: Cengage Learning, 2011",
        "SINTES, T.; SINTES, A. Aprenda programação orientada a objetos em 21 dias. 1ª ed. Pearson, 2002",
        "HAVERBEKE, M. Eloquent JavaScript: a modern introduction to programming. San Francisco: No Starch Press, 2011",
        "SANTOS, R. Lógica de programação: crie seus primeiros programas usando JavaScript e HTML. São Paulo: Editora Casa do Código, 2012",
        "MORRISON, M. Use a cabeça: JAVASCRIPT. Rio de Janeiro: Alta Books, 2012",
        "FREEMAN, E.; FREEMAN, E. Use a cabeça! HTML com CSS e XHTML. 2ª ed. Rio de Janeiro: Alta Books, 2008",
        "VENANCIO, C. F. Desenvolvimento de Algoritmos. Editora Érica.",
        "SILVA, F. S. C. Lógica para Computação. 1ª ed. São Paulo: Cenage Learning, 2006",
        "ASCENCIO, A. F. G. Estrutura de dados: algoritmos, análise da complexidade e implementações em Java e C/C++. Rio de Janeiro, RJ: Pearson Prentice Hall, 2010",
        "SANTOS, R. V. M. Algoritmos. Cuiabá, MT: IFMT, 2009",
        "NETTO, P. O. B. Grafos: Teoria, modelos, algorísmos. Edgard Blucher, 2006",
        "COLLINS, R. D. Do diagnóstico ao tratamento através de Algoritmos. Revinter, 2005",
        "CORMEN, T. H. Desmistificando Algoritmos. São Paulo: Elsevier, 2013",
        "KOLIVER, C. Introdução à construção de algoritmos: notas de aulas. Caxias do Sul: EDUCS, 2009",
        "LUTZ, M.; ASCHER, D. Aprendendo Python. 2ª ed. Porto Alegre, Bookman, 2007",
        "AGUILAR, L. Fundamentos de Programação: Algoritmos, Estruturas de Dados e Objetos. 3ª ed. McGraw-Hill, 2008",
        "MIZRAHI, V. V. Treinamento em linguagem C. Módulo 2. Prentice Hall, 2004",
        "POLIDÓRIO, A.; FRANCO, C. Algoritmos: uma abordagem sintática e semântica. Universidade Estadual de Maringá. 1994",
        "SPOTTO, E. S. Algoritmos e Estrutura de Dados. Universidade Estadual de Maringá, 1993",
        "DALE, N. B.; LEWIS, J. Ciência da computação. 4ª ed. Rio de Janeiro: LTC, 2011",
        "RIBEIRO, A. E. (Orgs). Linguagem, tecnologia e educação. São Paulo: Peirópolis, 2010",
        "VERMÃ, S. Ideias geniais na matemática: maravilhas, curiosidades, enigmas e soluções brilhantes da mais fascinante das ciências. 2ª ed. Belo Horizonte: Gutenberg, 2013",
        "PAES, R. B. Introdução à programação com a linguagem C. São Paulo: Novatec, 2016",
        "CADENHEAD, R.; LEMAY, L. Aprenda em 21 dias: java 2; professional reference. Rio de Janeiro: Elsevier, 2003",
        "IBPI. Técnicas de programação com PASCAL, IBPI Press, 1993",
        "UCCI, W. Lógica de programação: os primeiros passos. São Paulo: Érica, 2002",
        "MANZANO, J. A. N. G.; YAMATUMI, W. Y. Free Pascal - Programação de Computadores, Ed. Érica, 2007",
        "ALVES, W. P. Lógica de Programação de Computadores: Ensino Didático. São Paulo: Érica, 2010",
        "CARNIELLI, W. A.; EPSTEIN, R. L. Computabilidade, funções computáveis, lógica e os fundamentos da Matemática, 2ª ed. São Paulo: Novatec, 2015",
        "PAIVA, S. Introdução à Programação: do algoritmo às linguagens atuais. Rio de Janeiro: Ciência Moderna, 2008",
        "PAIVA, S. Introdução à Programação: do algoritmo às linguagens atuais. Rio de Janeiro: Ciência Moderna, 2008",
        "KELLER, V.; BASTOS, C. L. Aprendendo lógica. 21ª ed. Petrópolis: Vozes, 2015",
        "STROUSTRUP, B. C++: a linguagem de programação. Porto Alegre: Bookman, 2000",
        "MCMANUS, S. Aprenda a programar em 10 lições fáceis. São Paulo: Quarto, 2017",
        "VARELA, H. F.; PEVIANI, C. T. Scratch: um jeito divertido de aprender programação. São Paulo: Casa do Código, 2017",
        "HICKSON, R. Aprenda a programar em C, C++ e C#. 2ª ed. Rio de Janeiro: Elsevier, 2005",
        "MAGRI, J. A. Lógica de Programação: ensino prático. São Paulo: Érica, 2003",
        "MANZANO, J. A. N. G. C++ ANSI: programação de computadores guia prático. São Paulo: Érica, 2003",
        "SCHILDT, H. C++: fundamentos e prática. Rio de Janeiro: Alta Books, 2004",
        "GOUVÊA, E. F. Estrtuturas de dados e algoritmos: padrões de projetos orientados a objetos com java. Rio de Janeiro: 2001",
        "POLYA, G. A arte de resolver problemas. Rio de Janeiro: Interciência, 1977",
        "KOFFMAN, E. B. Objetos, Abstração, Estruturas de Dados e Projetos usando Java 5.0. 1ª ed. Rio de Janeiro: LTC, 2008",
        "SEDGEWICK, R.; WAYNE, K. Algorithms. 4ª ed. Addison Wesley Professional, 2011",
        "BARRY, P. Use a cabeça! Java. Rio de Janeiro: Alta Books, 2010",
        "LAFORE, R. Estruturas de dados e algoritmos em Java. Rio de Janeiro: Elsevier, 2003",
        "WAZLAWICK, R. S. Análise e projetos de sistemas de informação orientados a objetos. 2ª ed. São Paulo: Elsevier Campus, 2010",
        "KATHY, S.; BERT, B. Use a Cabeça! Java. 2ª ed. Rio de Janeiro: Alta Books, 2007",
        "RODRIGUES, A. Desenvolvimento para Internet. Curitiba: Editora do livro técnico, 2010",
        "STARK, J.; JEPSON, B. Construindo aplicativos Android com HTML, CSS e Javascript. São Paulo: Novatec, 2012",
        "MANZANO, J. A. N. G.; COSTA JUNIOR, R. A. Java 7 - Programação de Computadores - Guia prático de Introdução, Orientação e Desenvolvimento. Érica, 2011",
        "LECHETA, R. R. Google Andorid: Aprenda a criar aplicações para dispositivos móveis com o Android SDK. 3ª ed. Novatec, 2013",
        "CAPRON, H. L.; JOHNSON, J. A. Introdução à informática. 8ª ed. São Paulo: Pearson Prentice Hall, 2004",
        "NUNES, R. C. Introdução à Informática. Florianópolos: IFSC, 2009",
        "PILONE, D.; MILLES, R. Use a cabeça: desenvolvimento de software. Rio de Janeiro: Alta Books, 2008",
        "FARRER, H. et al. Pascal estruturado. 3ª ed. Rio de Janeiro: LTC, 1999",
        "BERGAMASCHI, M. P.; ASENJO, M. N. Lógica de Programação. Fundamentos. Cubatão: 2000",
        "MARTINS, J. P. Programação em Python - Introdução à programação utilizando múltiplos paradigmas. 1ª ed. Press, 2015",
        "PUGA, S.; RISSETI, G. Lógica de programação e estrutura de dados. 2ª ed. Pearson, 2009",
        "MONTGOMERY, E. Programando com C: simples e prático. 1ª ed. São Paulo: Alta Books, 2006",
        "MANZANO, A. L. N. G.; MANZANO, M. I. N. G. Informática Básica. 7ª ed. São Paulo:  Editora Érica, 2007",
        "FOROUZAN, B.; MOSHARRAF, F. Fundamentos da Ciência da Computação. 2ª ed. São Paulo: Cengage Learning, 2012",
        "BANZI, M. Primeiros passos com o Arduino. São Paulo: Novatec, 2012",
        "RODRIGUES, P. et al. Programação em C++: algoritmos e estruturas de dados. 3ª ed. Lisboa: FCA, 2000",
        "SOUZA, J. N. Lógica para Ciência da Computação. Editora Campus, 2008",
        "TAHAN, M. O homem que calculava. Rio de Janeiro: Conquista, 1961",
        "CARNEIRO, A. G. Curso de Lógica de Programação: Viçosa: UFV, 2012"
    ]
}